In [1]:
# Import dependencies
import pandas as pd
import numpy as np
from sqlalchemy import create_engine
import matplotlib.pyplot as plt

In [ ]:
# Connect to database
database_url = 'postgresql://postgres:postgres@localhost:5432/market_analysis'
engine = create_engine(database_url)

In [3]:
# Query the customers table
query = 'select * from customers'
customers = pd.read_sql(query, engine)
customers.head()

   customerid         country
0     17850.0  United Kingdom
1     13047.0  United Kingdom
2     12583.0          France
3     13748.0  United Kingdom
4     15100.0  United Kingdom

In [4]:
# Query the transactions table
query2 = 'select * from transactions'
transactions = pd.read_sql(query2, engine)
transactions.head()

  invoiceno stockcode  quantity invoicedate  customerid  transaction_id
0    536365    85123A       6.0  2010-12-01     17850.0               1
1    536365     71053       6.0  2010-12-01     17850.0               2
2    536365    84406B       8.0  2010-12-01     17850.0               3
3    536365    84029G       6.0  2010-12-01     17850.0               4
4    536365    84029E       6.0  2010-12-01     17850.0               5

In [5]:
# Query the products table
query3 = 'select * from products'
products = pd.read_sql(query3, engine)
products.head()

  stockcode                          description  unitprice
0    85123A   WHITE HANGING HEART T-LIGHT HOLDER       2.55
1     71053                  WHITE METAL LANTERN       3.39
2    84406B       CREAM CUPID HEARTS COAT HANGER       2.75
3    84029G  KNITTED UNION FLAG HOT WATER BOTTLE       3.39
4    84029E       RED WOOLLY HOTTIE WHITE HEART.       3.39

In [6]:
# merge the dataframes
df = pd.merge(customers, transactions, on='customerid')
df = pd.merge(df, products, on='stockcode')
df.head()

,customerid,country,invoiceno,stockcode,quantity,invoicedate,transaction_id,description,unitprice
0,17850.0,United Kingdom,536365,85123A,6.0,2010-12-01,1,WHITE HANGING HEART T-LIGHT HOLDER,2.55
1,17850.0,United Kingdom,536373,85123A,6.0,2010-12-01,50,WHITE HANGING HEART T-LIGHT HOLDER,2.55
2,17850.0,United Kingdom,536375,85123A,6.0,2010-12-01,67,WHITE HANGING HEART T-LIGHT HOLDER,2.55
3,17850.0,United Kingdom,536396,85123A,6.0,2010-12-01,279,WHITE HANGING HEART T-LIGHT HOLDER,2.55
4,17850.0,United Kingdom,536406,85123A,8.0,2010-12-01,417,WHITE HANGING HEART T-LIGHT HOLDER,2.55

In [7]:
# Check the statistics for the quantity column
df["quantity"].describe()

count    540455.000000
mean          9.603129
std         218.007598
min      -80995.000000
25%           1.000000
50%           3.000000
75%          10.000000
max       80995.000000
Name: quantity, dtype: float64

In [ ]:
# Check the negative quantities
df_negative = df[df["quantity"] < 0]
df_negative.head()

,customerid,country,invoiceno,stockcode,quantity,invoicedate,transaction_id,description,unitprice
19,13047.0,United Kingdom,C559486,85123A,-1.0,2011-07-08,255362,WHITE HANGING HEART T-LIGHT HOLDER,2.55
26,17511.0,United Kingdom,C537602,85123A,-1.0,2010-12-07,14470,WHITE HANGING HEART T-LIGHT HOLDER,2.55
29,17511.0,United Kingdom,C542910,85123A,-1.0,2011-02-01,78898,WHITE HANGING HEART T-LIGHT HOLDER,2.55
36,17511.0,United Kingdom,C562709,85123A,-1.0,2011-08-08,293181,WHITE HANGING HEART T-LIGHT HOLDER,2.55
84,14911.0,EIRE,C539576,85123A,-24.0,2010-12-20,38327,WHITE HANGING HEART T-LIGHT HOLDER,2.55

In [17]:

# show the count for the unique stockcode in df_negative
df_negative["stockcode"].value_counts()

stockcode
M         244
22423     184
POST      126
22960      87
D          77
         ...
84826       1
84926F      1
79337       1
37482P      1
21819       1
Name: count, Length: 2111, dtype: int64

In [ ]:
# Close engine
engine.dispose()